openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Pwm.c
    /*
     * PWM052: The function Pwm_DeInit shall disable all notifications.
     */
    #if PWM_NOTIFICATION_SUPPORTED==STD_ON
        Pwm_DisableNotification(Channel);
    #endif
}

void Pwm_DeInit() {
	/* TODO: Implement Pwm_DeInit() */
	Pwm_ChannelType channel_iterator;

	if(E_OK != Pwm_ValidateInitialized(PWM_DEINIT_ID))
	{
		return;
	}

	for (channel_iterator = 0; channel_iterator < PWM_NUMBER_OF_CHANNELS; channel_iterator++) {
		Pwm_ChannelType channel = PwmConfigPtr->Channels[channel_iterator].channel;
		Pwm_DeInitChannel(channel);

	}

	// Disable module

	#if defined(CFG_MPC5516) || defined(CFG_MPC5567)

		EMIOS.MCR.B.MDIS = 1;

    #elif defined(CFG_MPC560X)

		EMIOS_0.MCR.B.MDIS = 1;
		EMIOS_1.MCR.B.MDIS = 1;

	#endif

	Pwm_ModuleState = PWM_STATE_UNINITIALIZED;
}
#endif


/*
 * PWM083: The function Pwm_SetPeriodAndDuty shall be pre compile time
 * changeable ON/OFF by the configuration parameter PwmSetPeriodAndDuty.
 */
#if PWM_SET_PERIOD_AND_DUTY_API==STD_ON
	void Pwm_SetPeriodAndDuty(Pwm_ChannelType Channel, Pwm_PeriodType Period,
			Pwm_DutyCycleType DutyCycle) {

		if ((E_OK != Pwm_ValidateInitialized(PWM_SETPERIODANDDUTY_ID)) ||
			(E_OK != Pwm_ValidateChannel(Channel, PWM_SETPERIODANDDUTY_ID)))
		{
			return;
		}
		if(ChannelRuntimeStruct[Channel].Class != PWM_VARIABLE_PERIOD)
		{
#if PWM_DEV_ERROR_DETECT==STD_ON
			Det_ReportError(PWM_MODULE_ID,0, PWM_SETPERIODANDDUTY_ID, PWM_E_PERIOD_UNCHANGEABLE);
#endif
			return;
		}

		uint16 leading_edge_position = (uint16) (((uint32) Period * (uint32) DutyCycle) >> 15);

		#if defined(CFG_MPC5516) || defined(CFG_MPC5567)

			/* Timer instant for leading edge */
			EMIOS.CH[Channel].CADR.R = leading_edge_position;

			/* Timer instant for the period to restart */
			EMIOS.CH[Channel].CBDR.R = Period;

		#elif defined(CFG_MPC560X)

			if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1)
			{
				EMIOS_0.CH[Channel].CADR.R = leading_edge_position;
				EMIOS_0.CH[Channel].CBDR.R = Period;
			}
			else
			{
			 EMIOS_1.CH[Channel - PWM_NUMBER_OF_EACH_EMIOS].CADR.R = leading_edge_position;
			 EMIOS_1.CH[Channel - PWM_NUMBER_OF_EACH_EMIOS].CBDR.R = Period;
			}

		#endif
	}
#endif


/**
 * PWM013: The function Pwm_SetDutyCycle shall set the duty cycle of the PWM
 * channel.
 *
 * @TODO: How to conform with PWM018: "The driver shall forbid the spike on the PWM output signal"?
 *
 * @param Channel PWM channel to use. 0 <= Channel < PWM_NUMBER_OF_CHANNELS <= 16
 * @param DutyCycle 0 <= DutyCycle <= 0x8000
 */
#if PWM_SET_DUTY_CYCLE_API==STD_ON
void Pwm_SetDutyCycle(Pwm_ChannelType Channel, Pwm_DutyCycleType DutyCycle)
{
	if ((E_OK != Pwm_ValidateInitialized(PWM_SETDUTYCYCLE_ID)) ||
		(E_OK != Pwm_ValidateChannel(Channel, PWM_SETDUTYCYCLE_ID)))
	{
		return;
	}

	#if defined(CFG_MPC5516) || defined(CFG_MPC5567)

		uint16 leading_edge_position = (uint16) ((EMIOS.CH[Channel].CBDR.R
					* (uint32) DutyCycle) >> 15);

		/* Timer instant for leading edge */

		/*
		 * PWM017: The function Pwm_SetDutyCycle shall update the duty cycle at
		 * the end of the period if supported by the implementation and configured
		 * with PwmDutycycleUpdatedEndperiod. [ This is achieved in hardware since
		 * the A and B registers are double buffered ]
		 *
		 * PWM014: The function Pwm_SetDutyCycle shall set the output state according
		 * to the configured polarity parameter [which is already set from
		 * Pwm_InitChannel], when the duty parameter is 0% [=0] or 100% [=0x8000].
		 */
		EMIOS.CH[Channel].CADR.R = leading_edge_position;

	#elif defined(CFG_MPC560X)

		if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1)
		{
			uint16 leading_edge_position = (uint16) ((EMIOS_0.CH[Channel].CBDR.R* (uint32) DutyCycle) >> 15);

			EMIOS_0.CH[Channel].CADR.R = leading_edge_position;

		}
		else
		{
			uint16 leading_edge_position = (uint16) ((EMIOS_1.CH[Channel-PWM_NUMBER_OF_EACH_EMIOS].CBDR.R* (uint32) DutyCycle) >> 15);

			EMIOS_1.CH[Channel-PWM_NUMBER_OF_EACH_EMIOS].CADR.R = leading_edge_position;

		}
	#endif
}
#endif

#if  PWM_SET_OUTPUT_TO_IDLE_API == STD_ON
	void Pwm_SetOutputToIdle(Pwm_ChannelType Channel)
	{
		if ((E_OK != Pwm_ValidateInitialized(PWM_SETOUTPUTTOIDLE_ID)) ||
			(E_OK != Pwm_ValidateChannel(Channel, PWM_SETOUTPUTTOIDLE_ID)))
		{
			return;
		}

		/* TODO: Make Pwm_SetOutputToIdle sensitive to PwmIdleState (currently uses PwmPolarity) */

		#if defined(CFG_MPC5516) || defined(CFG_MPC5567)

			EMIOS.CH[Channel].CADR.R = 0;

		#elif defined(CFG_MPC560X)


			for (Pwm_ChannelType channel_iterator = 0; channel_iterator < PWM_NUMBER_OF_CHANNELS; channel_iterator++)
			{
				if(Channel == PwmConfigPtr->Channels[channel_iterator].channel)
				{
					Pwm_OutputStateType ChannelPol = PwmConfigPtr->Channels[channel_iterator].polarity;
					if(ChannelPol == PwmConfigPtr->IdleState[channel_iterator])
					{
						Pwm_SetDutyCycle(Channel,0x0000);
					}
					else
					{
						Pwm_SetDutyCycle(Channel,0x8000);
					}
				}

			}

		#endif

}
#endif
/*
 * PWM085: The function Pwm_GetOutputState shall be pre compile configurable
 * ON/OFF by the configuration parameter PwmGetOutputState
 */
#if PWM_GET_OUTPUT_STATE_API==STD_ON
	/*
	 * PWM022: The function Pwm_GetOutputState shall read the internal state
	 * of the PWM output signal and return it.
	 */
	Pwm_OutputStateType Pwm_GetOutputState(Pwm_ChannelType Channel)
	{
		if ((E_OK != Pwm_ValidateInitialized(PWM_GETOUTPUTSTATE_ID)) ||
			(E_OK != Pwm_ValidateChannel(Channel, PWM_GETOUTPUTSTATE_ID)))
		{
			return PWM_LOW;
		}

		#if defined(CFG_MPC5516) || defined(CFG_MPC5567)

			return EMIOS.CH[Channel].CSR.B.UCOUT;

		#elif defined(CFG_MPC560X)

			if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1)
			{
				return (Pwm_OutputStateType)(EMIOS_0.CH[Channel].CSR.B.UCOUT);
			}
			else
			{
				return (Pwm_OutputStateType)(EMIOS_1.CH[Channel-PWM_NUMBER_OF_EACH_EMIOS].CSR.B.UCOUT);
			}
		#endif

